Repository: KMiNT21/telegram-sport-event-bot
Catalog: locale/*/LC_MESSAGES/*.po
Languages: pt, ru

source: + Apply for participation
pt: + Inscreva-se para participar
ru: Подать заявку на участие

source: - Revoke application
pt: - Revogar pedido
ru: Отозвать свою заявку

source: en_US
pt: pt_BR
ru: ru_RU

source: New event created
pt: Novo evento criado
ru: Новое событие было создано

source: Played
pt: Jogados
ru: Сыграно

source: from
pt: de
ru: из

source: Players limit
pt: Limite de jogadores
ru: Лимит игроков

source: Event date and time
pt: Data e hora do evento
ru: Дата и время события

source: Event time out
pt: Tempo limite do evento
ru: Событие уже состоялось

source: Time left
pt: Tempo restante
ru: До события осталось

source: and
pt: e
ru: и

source: days
pt: dias
ru: дней

source: hours
pt: horas
ru: часов

source: Players list
pt: Lista de jogadores
ru: Список игроков

source: Reserve
pt: Reserva
ru: Резерв

source: Revoked applications
pt: Aplicativos retirados
ru: Отмененные заявки

source: No applications yet
pt: Ainda não há aplicativos
ru: Заявок пока нет

source: No events
pt: Sem eventos
ru: Нет открытых событий

source: No events to fix stat for
pt: Nenhum evento para corrigir a estatística
ru: Нет открытых событий для фиксации статистики

source: Current statistics for this chat room members:
pt: Estatísticas atuais para os membros desta sala de chat:
ru: Статистика участников этой группы:

source: Players statistics for this group
pt: Estatísticas de jogadores para este grupo
ru: Статистика участников группы

source: Registrations / Penalties
pt: Inscrições / Penalidades
ru: Регистрации / Штрафы

source: Available BOT commands: /event_add TEXT Register new event /event_remove Remove open event /event_update TEXT Change event description /limit XX Set players limit /event_datetime DATE TIME Set event date and time in any format. It will parsed automatically. Example 1: 2023-01-30, 18:00 Example2: tomorrow, 14:30 /info Show event details /add Register yourself to the event /remove Revoke your application /fix Fix event statistics (increment participants counters) /penalty USERID Increase someone's PENALTY counter for unreasonable skipping of the event without notification others. You can find USERID by command /stat /stat This group members statistics (registrations and penalties)
pt: Comandos BOT disponíveis: /event_add TEXTO Registrar novo evento /event_remove Remover evento aberto /event_update TEXTO Alterar descrição do evento /limit XX Definir limite de jogadores /event_datetime DATA HORA Defina a data e hora do evento em qualquer formato. Ele será analisado automaticamente. Exemplo 1: 2023-01-30, 18:00 Exemplo2: amanhã, 14:30 /info Mostrar detalhes do evento /add Inscreva-se no evento /remove Revogue seu aplicativo /fix Corrigir estatísticas de eventos (incrementar contadores de participantes) /penalty USERID Aumente o contador de PENALIDADE de alguém por pular injustificadamente do evento sem notificar outros. Você pode encontrar USERID pelo comando /stat /stat Estatísticas dos membros deste grupo (inscrições e penalidades)
ru: Доступные команды бота: /event_add TEXT Зарегистрировать новое событие /event_remove Удалить ранее созданное событие /event_update Изменить описание текущего события /limit XX Изменить описание текущего события /event_datetime ДАТА-ВРЕМЯ Задание даты события. Можно в произвольной формe. Пример 1: 2023-01-30, 18:00 Пример 2: послезавтра в 14:30 /info Показать сведения о текущем событии /add Добавить себя в список участников /remove Удалить себя из списка участников /fix Зафиксировать состав состоявшийся игры для статистики /penalty USERID Зафиксировать пропуск одной игры зарегистрированного заранее участника. Получить USERID можно с помощью команды /stat /stat Статистика участников группы (игры / штрафы)
