Repository: KMiNT21/telegram-sport-event-bot
Catalog: locale/ua/LC_MESSAGES/ua.po
Languages: ua

source: + Apply for participation
ua: Подати заявку на участь

source: - Revoke application
ua: Відкликати свою заявку

source: en_US
ua: ua_UA

source: New event created
ua: Нова подія була створена

source: Played
ua: Зіграно

source: from
ua: з

source: Players limit
ua: Ліміт гравців

source: Event date and time
ua: Дата та час події

source: Event time out
ua: Подія вже відбулася

source: Time left
ua: До події залишилося

source: and
ua: і

source: days
ua: днів

source: hours
ua: годин

source: Players list
ua: Список гравців

source: Reserve
ua: Резерв

source: Revoked applications
ua: Скасовані заявки

source: No applications yet
ua: Заявок поки що немає

source: No events
ua: Немає відкритих подій

source: Current statistics for this chat room members:
ua: Статистика учасників групи

source: Registrations / Penalties
ua: Реєстрація / Штрафи

source: Available BOT commands: /event_add TEXT Register new event /event_remove Remove open event /event_update TEXT Change event description /limit XX Set players limit /event_datetime DATE TIME Set event date and time in any format. It will parsed automatically. Example 1: 2023-01-30, 18:00 Example2: tomorrow, 14:30 /info Show event details /add Register yourself to the event /remove Revoke your application /fix Fix event statistics (increment participants counters) /penalty USERID Increase someone's PENALTY counter for unreasonable skipping of the event without notification others. You can find USERID by command /stat /stat This group members statistics (registrations and penalties)
ua: Доступні команди бота: /event_add TEXT Зареєструвати нову подію /event_remove Видалити раніше створену подію /event_update Змінити опис поточної події /limit XX Змінити опис поточної події /event_datetime ДАТА-ЧАС Завдання дати події. Можна у довільній формі. Приклад 1: 2023-01-30, 18:00 Приклад 2: післязавтра о 14:30 /info Показати інформацію про поточну подію /add Додати себе до списку учасників /remove Видалити себе зі списку учасників /fix Зафіксувати склад гри для статистики /penalty USERID Зафіксувати пропуск однієї гри зареєстрованого заздалегідь учасника. Отримати USERID можна за допомогою команди /stat /stat Статистика учасників групи (ігри/штрафи)
